cd cyq1

# migration reference
ns=768
dx=0.01
os=0

# 首先定义要对模型划分的层数以及层与层之间的重合厚度
# 根据上述划分，使用window程序生成每个层的速度模型文件
# 对于第一层，计算走时（使用eikods2d程序）并进行成像（使用kirchmig2d程序），得到第一层的成像结果,生成走时时需要观测系统参数，可以通过shotgen程序生成
# 然后将地震记录外推（使用kirchdat2d程序）到第二层的顶部对应的深度处，理论上来说，第二层的顶部对应的走时在第一层中包含，但是由于存在重合，所以第二层的顶部在第一层底部的上面
# 因此需要将地震记录外推到第二层的顶部对应的深度处，以便在第二层中进行成像
# 对于第二层，计算走时并进行成像，得到第二层的成像结果
# 然后以此类推，将所有层计算完毕
# 将所有层的成像结果进行叠加，得到最终的成像结果

nx=768
nz=261
nlayer=5
noverlap=10 # 网格点



# 第一层
# 切速度模型

../build/bin/window in=marmsmooth.rsf out=marmsmooth_1.rsf z1=0 z2=0.5 overlap=0.1




